app/Http/Controllers/Auth/RegisteredUserController.php

insert into "tenants" ("id", "data", "updated_at", "created_at") values ('rumah-makan-T33U', '[]', '2025-12-19 13:25:05', '2025-12-19 13:25:05')
insert into "restaurants" ("tenant_id", "name", "updated_at", "created_at") values ('rumah-makan-T33U', 'Rumah makan', '2025-12-19 13:25:05', '2025-12-19 13:25:05')
insert into "users" ("name", "email", "password", "tenant_id", "updated_at", "created_at") values ('bambank', 'alansuryajana094@gmail.com', '$2y$12$/56korENmuY5V8uB5IS4neHDWYutjHiP2ag7MlQRe982JaZCXKViC', 'rumah-makan-T33U', '2025-12-19 13:25:06', '2025-12-19 13:25:06')
---
    public function store(Request $request): RedirectResponse
    {
        $request->validate([
            'restaurant_name' => ['required', 'string', 'max:255'],
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'lowercase', 'email', 'max:255', 'unique:' . User::class],
            'password' => ['required', 'confirmed', Rules\Password::defaults()],
        ]);

        $user = \Illuminate\Support\Facades\DB::transaction(function () use ($request) {
            $tenantId = \Illuminate\Support\Str::slug($request->restaurant_name) . '-' . \Illuminate\Support\Str::random(4);

            $tenant = \App\Models\Tenant::create(['id' => $tenantId]);

            \App\Models\Restaurant::create([
                'tenant_id' => $tenant->id,
                'name' => $request->restaurant_name,
            ]);

            return User::create([
                'name' => $request->name,
                'email' => $request->email,
                'password' => Hash::make($request->password),
                'tenant_id' => $tenant->id,
            ]);