app/Services/DashboardService.php

select count(*) as aggregate from "feedback_responses" where "tenant_id" = 'rumah-makan-T33U' and "created_at" >= '2024-12-19 13:34:53'
select "ratings" from "feedback_responses" where "tenant_id" = 'rumah-makan-T33U' and "created_at" >= '2024-12-19 13:34:53'
---
    public function getStats($tenantId, $range = 30)
    {
        $query = DB::table('feedback_responses')
            ->where('tenant_id', $tenantId)
            ->when($range !== 'all', function ($q) use ($range) {
                $q->where('created_at', '>=', Carbon::now()->subDays((int) $range));
            });

        $totalFeedback = $query->count();

        $allFeedbacks = $query->select('ratings')->get();

select "ratings" from "feedback_responses" where "tenant_id" = 'rumah-makan-T33U' and "created_at" >= '2024-12-19 13:34:53'
---
    public function getSentimentData($tenantId, $range = 30)
    {
        $query = DB::table('feedback_responses')
            ->where('tenant_id', $tenantId)
            ->when($range !== 'all', function ($q) use ($range) {
                $q->where('created_at', '>=', Carbon::now()->subDays((int) $range));
            });

        $feedbacks = $query->select('ratings')->get();

select "created_at", "ratings" from "feedback_responses" where "tenant_id" = 'rumah-makan-T33U' and "created_at" >= '2025-11-19 13:49:46' order by "created_at" asc
---
    public function getTrendData($tenantId, $range = 30)
    {
        $days = $range === 'all' ? 365 : (int) $range;
        $startDate = Carbon::now()->subDays($days);

        $feedbacks = DB::table('feedback_responses')
            ->where('tenant_id', $tenantId)
            ->where('created_at', '>=', $startDate)
            ->orderBy('created_at')
            ->get(['created_at', 'ratings']);