app/Http/Controllers/FeedbackController.php

    public function show($uuid)
    {
        // Use DB Facade for QrCode retrieval to bypass Eloquent/Tenancy issues in tests
        $qrCode = \Illuminate\Support\Facades\DB::table('qr_codes')
            ->where('unique_code', $uuid)
            ->first();

        if (!$qrCode) {
            abort(404);
        }

        if (!$qrCode->is_active) {
            abort(404, 'Form is not active.');
        }

        // Use DB Facade to bypass Model/Scope issues in mixed tenancy contexts (public routes)
        $questionnaireRaw = \Illuminate\Support\Facades\DB::table('questionnaires')
            ->where('id', $qrCode->questionnaire_id)
            ->first();

        $questionnaire = new \stdClass();
        if ($questionnaireRaw) {
            $questionnaire->id = $questionnaireRaw->id;
            $questionnaire->title = $questionnaireRaw->title;
            // Decode questions manually
            $questionnaire->questions = json_decode($questionnaireRaw->questions, true) ?? [];
            $questionnaire->tenant_id = $questionnaireRaw->tenant_id;

            $restaurantRaw = \Illuminate\Support\Facades\DB::table('restaurants')
                ->where('tenant_id', $questionnaire->tenant_id)
                ->first();
---
select * from "qr_codes" where "unique_code" = '0cc14fe4-1c73-4ada-a1bc-d95aeb00e86a' limit 1
select * from "questionnaires" where "id" = 1 limit 1
select * from "restaurants" where "tenant_id" = 'rumah-makan-T33U' limit 1

    public function store(Request $request, $uuid)
    {
        $qrCode = \Illuminate\Support\Facades\DB::table('qr_codes')
            ->where('unique_code', $uuid)
            ->first();

        if (!$qrCode || !$qrCode->is_active) {
            abort(404);
        }

        // Basic validation
        $request->validate([
            'ratings' => 'required|array',
            'feedback_text' => 'nullable|string|max:1000',
        ]);

        // Use Eloquent for creation if possible, otherwise DB::table
        // Use Eloquent for creation if possible, otherwise DB::table
        // Bypass Eloquent/Model completely for public route to avoid Tenancy Scoping issues
        try {
            \Illuminate\Support\Facades\DB::table('feedback_responses')->insert([
                'tenant_id' => $qrCode->tenant_id,
                'qr_code_id' => $qrCode->id,
                'ratings' => json_encode($request->ratings),
                'feedback_text' => $request->input('feedback_text'),
                'customer_info' => json_encode([]),
                'status' => 'unread',
                'created_at' => now(),
                'updated_at' => now(),
            ]);
---
select * from "qr_codes" where "unique_code" = '0cc14fe4-1c73-4ada-a1bc-d95aeb00e86a' limit 1
insert into "feedback_responses" ("tenant_id", "qr_code_id", "ratings", "feedback_text", "customer_info", "status", "created_at", "updated_at") values ('rumah-makan-T33U', 1, '{"q1":"5","q2":"5","q3":"5","q4":"yes"}', 'oke', '[]', 'unread', '2025-12-19 13:38:44', '2025-12-19 13:38:44')