app/Http/Controllers/FeedbackInboxController.php

    public function index(Request $request)
    {
        // Bypass TenancyScope if active, and manually enforce User's Tenant ID
        $query = FeedbackResponse::query()
            ->withoutGlobalScopes()
            ->where('tenant_id', \Illuminate\Support\Facades\Auth::user()->tenant_id)
            ->with('qrCode')
            ->latest();

        if ($request->has('status')) {
            $query->where('status', $request->status);
        }

        if ($request->has('search') && $request->search) {
            $query->where('feedback_text', 'like', '%' . $request->search . '%')
                ->orWhereHas('qrCode', function ($q) use ($request) {
                    $q->where('name', 'like', '%' . $request->search . '%');
                });
        }

        $feedbacks = $query->paginate(20);
---
select * from "feedback_responses" where "tenant_id" = 'rumah-makan-T33U' order by "created_at" desc limit 20 offset 0
select * from "qr_codes" where "qr_codes"."id" in (1)
select count(*) as aggregate from "feedback_responses" where "tenant_id" = 'rumah-makan-T33U' and "status" = 'unread'