app/Http/Controllers/QrCodeController.php

select * from "restaurants" where "restaurants"."tenant_id" = 'rumah-makan-T33U' limit 1
select * from "qr_codes" where "qr_codes"."tenant_id" = 'rumah-makan-T33U' and "qr_codes"."tenant_id" is not null order by "created_at" desc limit 10 offset 0
select * from "questionnaires" where "questionnaires"."id" in (1)
select count(*) as aggregate from "qr_codes" where "qr_codes"."tenant_id" = 'rumah-makan-T33U' and "qr_codes"."tenant_id" is not null
---
    public function index()
    {
        $restaurant = Auth::user()->restaurant ?? \App\Models\Restaurant::where('tenant_id', Auth::user()->tenant_id)->first();

        $qrCodes = $restaurant ?
            $restaurant->qrCodes()->with('questionnaire')->latest()->paginate(10) :

select * from "restaurants" where "restaurants"."tenant_id" = 'rumah-makan-T33U' limit 1
select * from "questionnaires" where "questionnaires"."tenant_id" = 'rumah-makan-T33U' and "questionnaires"."tenant_id" is not null and "questionnaires"."id" = '2' limit 1
---
    public function store(Request $request)
    {
        $request->validate([
            'questionnaire_id' => 'required|exists:questionnaires,id',
            'name' => 'required|string|max:255',
        ]);

        $restaurant = Auth::user()->restaurant ?? \App\Models\Restaurant::where('tenant_id', Auth::user()->tenant_id)->firstOrFail();

        // Ensure questionnaire belongs to tenant
        $questionnaire = $restaurant->questionnaires()->findOrFail($request->questionnaire_id);

insert into "qr_codes" ("questionnaire_id", "name", "unique_code", "image_path", "is_active", "tenant_id", "updated_at", "created_at") values (2, 'meja1', 'f68da66b-16f6-4562-be40-6f1405829d4d', 'qr-codes/rumah-makan-T33U/f68da66b-16f6-4562-be40-6f1405829d4d.png', 1, 'rumah-makan-T33U', '2025-12-19 14:37:35', '2025-12-19 14:37:35')
---

        Storage::disk('public')->put($path, $image);

        $restaurant->qrCodes()->create([
            'questionnaire_id' => $questionnaire->id,
            'name' => $request->name,
            'unique_code' => $uniqueCode,
            'image_path' => $path,
            'is_active' => true,
        ]);