app/Http/Controllers/QuestionnaireController.php

    public function index()
    {
        $questionnaires = Questionnaire::where('tenant_id', Auth::user()->tenant_id)
            ->latest()
            ->get();
---
select * from "questionnaires" where "tenant_id" = 'rumah-makan-T33U' order by "created_at" desc

    public function store(Request $request)
    {
        // dd('Store method hit', Auth::user()->id);
        $request->validate([
            'template' => 'required|string',
        ]);

        $templateKey = $request->input('template');
        $templates = config('questionnaire_templates');

        if (!isset($templates[$templateKey])) {
            return back()->withErrors(['template' => 'Invalid template selected.']);
        }

        $template = $templates[$templateKey];

        /** @var \App\Models\Restaurant $restaurant */
        $restaurant = Auth::user()->restaurant ?? \App\Models\Restaurant::where('tenant_id', Auth::user()->tenant_id)->firstOrFail();

        $questionnaire = $restaurant->questionnaires()->create([
            'title' => $template['name'], // Default title to template name
            'template_type' => $templateKey,
            'questions' => $template['questions'],
        ]);
---
select * from "restaurants" where "restaurants"."tenant_id" = 'rumah-makan-T33U' limit 1
insert into "questionnaires" ("title", "template_type", "questions", "tenant_id", "updated_at", "created_at") values ('Café / Coffee Shop', 'cafe', '[{"id":"q1","text":"Bagaimana rasa minuman\/kopi kami?","type":"rating","options":[],"required":true},{"id":"q2","text":"Bagaimana suasana\/ambience cafe?","type":"rating","options":[],"required":true},{"id":"q3","text":"Kecepatan penyajian?","type":"rating","options":[],"required":true},{"id":"q4","text":"Wifi lancar?","type":"boolean","options":["Ya","Tidak"],"required":false}]', 'rumah-makan-T33U', '2025-12-19 13:35:23', '2025-12-19 13:35:23')

    public function edit(Questionnaire $questionnaire)
    {
        // Ensure user owns the questionnaire
        $restaurantId = Auth::user()->restaurant->id ?? \App\Models\Restaurant::where('tenant_id', Auth::user()->tenant_id)->value('id');
---
select * from "restaurants" where "restaurants"."tenant_id" = 'rumah-makan-T33U' limit 1